dic = {'S21-0001': {'이름' : '최성훈',
                    '성구분' : 'M',
                    '전공' : '디자인',
                    '연락처' : '010-1234-5678',
                    '메일' : 'abc@gmail.com',
                    '취미' : ['농구', '음악']},
'S21-0002': {'이름' : '김가람',
                    '성구분' : 'M',
                    '전공' : '화학',
                    '연락처' : '010-1111-2222',
                    '메일' : 'bbb@gmail.com',
                    '취미' : ['축구']},
'S21-0003': {'이름':'박보배',
                    '성구분':'F',
                    '전공':'컴공',
                    '연락처':'010-3333-4444',
                    '메일':'ccc@gmail.com',
                    '취미':['음악']}}

for k1 in dic.keys():
    print(f'학생번호: {k1}')

    for k2 in dic[k1].keys():
        print(f'{k2} : {dic[k1][k2]}')